node {
  name: "is_training"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "data_loading/tensors/normalize_tensors/component_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\020B\000\000\200\277\000\000WC\000\000\200?\000\200\322C\000\000\200?\000\000\366B\000\000\200?\000\000\311C\000\000\200?\000\000\331C\000\000\200\277\000\000\014B\000\000\200?\000\0005C\000\000\200?\000\000\270B\000\000\200?\000\000\312C\000\000\200\277\000\0007C\000\000\200\277\000\000YC\000\000\200\277\000\000\010B\000\000\200?\000\000\350A\000\000\200\277\000\000\274B\000\000\200\277\000\000\330C\000\000\200?\000\000\330A\000\000\200?\000\000\372B\000\000\200\277\000\000\024B\000\000\200\277\000\200\323C\000\000\200\277"
      }
    }
  }
}
node {
  name: "data_loading/TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "data_loading/tensors/normalize_tensors/component_0"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "data_loading/buffer_size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 20
      }
    }
  }
}
node {
  name: "data_loading/seed"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 8964
      }
    }
  }
}
node {
  name: "data_loading/seed2/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 4
      }
    }
  }
}
node {
  name: "data_loading/seed2/Equal/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "data_loading/seed2/Equal"
  op: "Equal"
  input: "data_loading/seed"
  input: "data_loading/seed2/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "data_loading/seed2/Equal_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "data_loading/seed2/Equal_1"
  op: "Equal"
  input: "data_loading/seed2/Const"
  input: "data_loading/seed2/Equal_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "data_loading/seed2/LogicalAnd"
  op: "LogicalAnd"
  input: "data_loading/seed2/Equal"
  input: "data_loading/seed2/Equal_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "data_loading/seed2/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 2147483647
      }
    }
  }
}
node {
  name: "data_loading/seed2"
  op: "Select"
  input: "data_loading/seed2/LogicalAnd"
  input: "data_loading/seed2/Const_1"
  input: "data_loading/seed2/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "data_loading/ShuffleDataset"
  op: "ShuffleDataset"
  input: "data_loading/TensorSliceDataset"
  input: "data_loading/buffer_size"
  input: "data_loading/seed"
  input: "data_loading/seed2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "reshuffle_each_iteration"
    value {
      b: true
    }
  }
}
node {
  name: "data_loading/count"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "data_loading/RepeatDataset"
  op: "RepeatDataset"
  input: "data_loading/ShuffleDataset"
  input: "data_loading/count"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "data_loading/num_parallel_calls"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 6
      }
    }
  }
}
node {
  name: "data_loading/ParallelMapDataset"
  op: "ParallelMapDataset"
  input: "data_loading/RepeatDataset"
  input: "data_loading/num_parallel_calls"
  attr {
    key: "Targuments"
    value {
      list {
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_Dataset_map_Davis2016Reader.dataset_map_216"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "preserve_cardinality"
    value {
      b: false
    }
  }
  attr {
    key: "sloppy"
    value {
      b: false
    }
  }
  attr {
    key: "use_inter_op_parallelism"
    value {
      b: true
    }
  }
}
node {
  name: "data_loading/batch_size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "data_loading/drop_remainder"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "data_loading/BatchDatasetV2"
  op: "BatchDatasetV2"
  input: "data_loading/ParallelMapDataset"
  input: "data_loading/batch_size"
  input: "data_loading/drop_remainder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "parallel_copy"
    value {
      b: false
    }
  }
}
node {
  name: "data_loading/buffer_size_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 96
      }
    }
  }
}
node {
  name: "data_loading/PrefetchDataset"
  op: "PrefetchDataset"
  input: "data_loading/BatchDatasetV2"
  input: "data_loading/buffer_size_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "slack_period"
    value {
      i: 0
    }
  }
}
node {
  name: "data_loading/optimizations"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        string_val: "map_and_batch_fusion"
        string_val: "noop_elimination"
        string_val: "shuffle_and_repeat_fusion"
      }
    }
  }
}
node {
  name: "data_loading/OptimizeDataset"
  op: "OptimizeDataset"
  input: "data_loading/PrefetchDataset"
  input: "data_loading/optimizations"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "optimization_configs"
    value {
      list {
        s: "map_vectorization:use_choose_fastest:false"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "data_loading/ModelDataset"
  op: "ModelDataset"
  input: "data_loading/OptimizeDataset"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "cpu_budget"
    value {
      i: 0
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "data_loading/IteratorV2"
  op: "IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "data_loading/MakeIterator"
  op: "MakeIterator"
  input: "data_loading/ModelDataset"
  input: "data_loading/IteratorV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorV2"
      }
    }
  }
}
node {
  name: "data_loading/IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "data_loading/IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "data_loading/IteratorGetNext"
  op: "IteratorGetNext"
  input: "data_loading/IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "data_loading/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "data_loading/tensors_1/normalize_tensors/component_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 462
          }
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 462
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\300@\000\000\200?\000\000\000A\000\000\200?\000\000 A\000\000\200?\000\000@A\000\000\200?\000\000\270A\000\000\200?\000\000\330A\000\000\200?\000\000\340A\000\000\200?\000\000\010B\000\000\200?\000\000\014B\000\000\200?\000\000\020B\000\000\200?\000\0000B\000\000\200?\000\000TB\000\000\200?\000\000dB\000\000\200?\000\000\232B\000\000\200?\000\000\270B\000\000\200?\000\000\272B\000\000\200?\000\000\306B\000\000\200?\000\000\316B\000\000\200?\000\000\344B\000\000\200?\000\000\354B\000\000\200?\000\000\366B\000\000\200?\000\000\370B\000\000\200?\000\000\025C\000\000\200?\000\000\035C\000\000\200?\000\000 C\000\000\200?\000\0005C\000\000\200?\000\0006C\000\000\200?\000\000@C\000\000\200?\000\000JC\000\000\200?\000\000WC\000\000\200?\000\000XC\000\000\200?\000\000sC\000\000\200?\000\000yC\000\000\200?\000\000{C\000\000\200?\000\000\177C\000\000\200?\000\200\202C\000\000\200?\000\000\212C\000\000\200?\000\000\225C\000\000\200?\000\000\226C\000\000\200?\000\200\230C\000\000\200?\000\000\237C\000\000\200?\000\200\244C\000\000\200?\000\200\246C\000\000\200?\000\000\254C\000\000\200?\000\200\265C\000\000\200?\000\200\270C\000\000\200?\000\000\272C\000\000\200?\000\000\273C\000\000\200?\000\200\302C\000\000\200?\000\000\304C\000\000\200?\000\000\311C\000\000\200?\000\200\311C\000\000\200?\000\200\322C\000\000\200?\000\000\323C\000\000\200?\000\200\325C\000\000\200?\000\000\330C\000\000\200?\000\200\330C\000\000\200?\000\000\335C\000\000\200?\000\200\343C\000\000\200?\000\000\345C\000\000\200?\000\000\000\000\000\000\200\277\000\000\200?\000\000\200\277\000\000\000@\000\000\200\277\000\000@@\000\000\200\277\000\000\200@\000\000\200\277\000\000\240@\000\000\200\277\000\000\340@\000\000\200\277\000\000\020A\000\000\200\277\000\0000A\000\000\200\277\000\000PA\000\000\200\277\000\000`A\000\000\200\277\000\000pA\000\000\200\277\000\000\200A\000\000\200\277\000\000\210A\000\000\200\277\000\000\220A\000\000\200\277\000\000\230A\000\000\200\277\000\000\240A\000\000\200\277\000\000\250A\000\000\200\277\000\000\260A\000\000\200\277\000\000\300A\000\000\200\277\000\000\310A\000\000\200\277\000\000\320A\000\000\200\277\000\000\350A\000\000\200\277\000\000\360A\000\000\200\277\000\000\370A\000\000\200\277\000\000\000B\000\000\200\277\000\000\004B\000\000\200\277\000\000\024B\000\000\200\277\000\000\030B\000\000\200\277\000\000\034B\000\000\200\277\000\000 B\000\000\200\277\000\000$B\000\000\200\277\000\000(B\000\000\200\277\000\000,B\000\000\200\277\000\0004B\000\000\200\277\000\0008B\000\000\200\277\000\000<B\000\000\200\277\000\000@B\000\000\200\277\000\000DB\000\000\200\277\000\000HB\000\000\200\277\000\000LB\000\000\200\277\000\000PB\000\000\200\277\000\000XB\000\000\200\277\000\000\\B\000\000\200\277\000\000`B\000\000\200\277\000\000hB\000\000\200\277\000\000lB\000\000\200\277\000\000pB\000\000\200\277\000\000tB\000\000\200\277\000\000xB\000\000\200\277\000\000|B\000\000\200\277\000\000\200B\000\000\200\277\000\000\202B\000\000\200\277\000\000\204B\000\000\200\277\000\000\206B\000\000\200\277\000\000\210B\000\000\200\277\000\000\212B\000\000\200\277\000\000\214B\000\000\200\277\000\000\216B\000\000\200\277\000\000\220B\000\000\200\277\000\000\222B\000\000\200\277\000\000\224B\000\000\200\277\000\000\226B\000\000\200\277\000\000\230B\000\000\200\277\000\000\234B\000\000\200\277\000\000\236B\000\000\200\277\000\000\240B\000\000\200\277\000\000\242B\000\000\200\277\000\000\244B\000\000\200\277\000\000\246B\000\000\200\277\000\000\250B\000\000\200\277\000\000\252B\000\000\200\277\000\000\254B\000\000\200\277\000\000\256B\000\000\200\277\000\000\260B\000\000\200\277\000\000\262B\000\000\200\277\000\000\264B\000\000\200\277\000\000\266B\000\000\200\277\000\000\274B\000\000\200\277\000\000\276B\000\000\200\277\000\000\300B\000\000\200\277\000\000\302B\000\000\200\277\000\000\304B\000\000\200\277\000\000\310B\000\000\200\277\000\000\312B\000\000\200\277\000\000\314B\000\000\200\277\000\000\320B\000\000\200\277\000\000\322B\000\000\200\277\000\000\324B\000\000\200\277\000\000\326B\000\000\200\277\000\000\330B\000\000\200\277\000\000\332B\000\000\200\277\000\000\334B\000\000\200\277\000\000\336B\000\000\200\277\000\000\340B\000\000\200\277\000\000\342B\000\000\200\277\000\000\346B\000\000\200\277\000\000\350B\000\000\200\277\000\000\352B\000\000\200\277\000\000\356B\000\000\200\277\000\000\360B\000\000\200\277\000\000\362B\000\000\200\277\000\000\364B\000\000\200\277\000\000\372B\000\000\200\277\000\000\374B\000\000\200\277\000\000\376B\000\000\200\277\000\000\000C\000\000\200\277\000\000\001C\000\000\200\277\000\000\002C\000\000\200\277\000\000\003C\000\000\200\277\000\000\004C\000\000\200\277\000\000\005C\000\000\200\277\000\000\006C\000\000\200\277\000\000\007C\000\000\200\277\000\000\010C\000\000\200\277\000\000\tC\000\000\200\277\000\000\nC\000\000\200\277\000\000\013C\000\000\200\277\000\000\014C\000\000\200\277\000\000\rC\000\000\200\277\000\000\016C\000\000\200\277\000\000\017C\000\000\200\277\000\000\020C\000\000\200\277\000\000\021C\000\000\200\277\000\000\022C\000\000\200\277\000\000\023C\000\000\200\277\000\000\024C\000\000\200\277\000\000\026C\000\000\200\277\000\000\027C\000\000\200\277\000\000\030C\000\000\200\277\000\000\031C\000\000\200\277\000\000\032C\000\000\200\277\000\000\033C\000\000\200\277\000\000\034C\000\000\200\277\000\000\036C\000\000\200\277\000\000\037C\000\000\200\277\000\000!C\000\000\200\277\000\000\"C\000\000\200\277\000\000#C\000\000\200\277\000\000$C\000\000\200\277\000\000%C\000\000\200\277\000\000&C\000\000\200\277\000\000\'C\000\000\200\277\000\000(C\000\000\200\277\000\000)C\000\000\200\277\000\000*C\000\000\200\277\000\000+C\000\000\200\277\000\000,C\000\000\200\277\000\000-C\000\000\200\277\000\000.C\000\000\200\277\000\000/C\000\000\200\277\000\0000C\000\000\200\277\000\0001C\000\000\200\277\000\0002C\000\000\200\277\000\0003C\000\000\200\277\000\0004C\000\000\200\277\000\0007C\000\000\200\277\000\0008C\000\000\200\277\000\0009C\000\000\200\277\000\000:C\000\000\200\277\000\000;C\000\000\200\277\000\000<C\000\000\200\277\000\000=C\000\000\200\277\000\000>C\000\000\200\277\000\000?C\000\000\200\277\000\000AC\000\000\200\277\000\000BC\000\000\200\277\000\000CC\000\000\200\277\000\000DC\000\000\200\277\000\000EC\000\000\200\277\000\000FC\000\000\200\277\000\000GC\000\000\200\277\000\000HC\000\000\200\277\000\000IC\000\000\200\277\000\000KC\000\000\200\277\000\000LC\000\000\200\277\000\000MC\000\000\200\277\000\000NC\000\000\200\277\000\000OC\000\000\200\277\000\000PC\000\000\200\277\000\000QC\000\000\200\277\000\000RC\000\000\200\277\000\000SC\000\000\200\277\000\000TC\000\000\200\277\000\000UC\000\000\200\277\000\000VC\000\000\200\277\000\000YC\000\000\200\277\000\000ZC\000\000\200\277\000\000[C\000\000\200\277\000\000\\C\000\000\200\277\000\000]C\000\000\200\277\000\000^C\000\000\200\277\000\000_C\000\000\200\277\000\000`C\000\000\200\277\000\000aC\000\000\200\277\000\000bC\000\000\200\277\000\000cC\000\000\200\277\000\000dC\000\000\200\277\000\000eC\000\000\200\277\000\000fC\000\000\200\277\000\000gC\000\000\200\277\000\000hC\000\000\200\277\000\000iC\000\000\200\277\000\000jC\000\000\200\277\000\000kC\000\000\200\277\000\000lC\000\000\200\277\000\000mC\000\000\200\277\000\000nC\000\000\200\277\000\000oC\000\000\200\277\000\000pC\000\000\200\277\000\000qC\000\000\200\277\000\000rC\000\000\200\277\000\000tC\000\000\200\277\000\000uC\000\000\200\277\000\000vC\000\000\200\277\000\000wC\000\000\200\277\000\000xC\000\000\200\277\000\000zC\000\000\200\277\000\000|C\000\000\200\277\000\000}C\000\000\200\277\000\000~C\000\000\200\277\000\000\200C\000\000\200\277\000\200\200C\000\000\200\277\000\000\201C\000\000\200\277\000\200\201C\000\000\200\277\000\000\202C\000\000\200\277\000\000\203C\000\000\200\277\000\200\203C\000\000\200\277\000\000\204C\000\000\200\277\000\200\204C\000\000\200\277\000\000\205C\000\000\200\277\000\200\205C\000\000\200\277\000\000\206C\000\000\200\277\000\200\206C\000\000\200\277\000\000\207C\000\000\200\277\000\200\207C\000\000\200\277\000\000\210C\000\000\200\277\000\200\210C\000\000\200\277\000\000\211C\000\000\200\277\000\200\211C\000\000\200\277\000\200\212C\000\000\200\277\000\000\213C\000\000\200\277\000\200\213C\000\000\200\277\000\000\214C\000\000\200\277\000\200\214C\000\000\200\277\000\000\215C\000\000\200\277\000\200\215C\000\000\200\277\000\000\216C\000\000\200\277\000\200\216C\000\000\200\277\000\000\217C\000\000\200\277\000\200\217C\000\000\200\277\000\000\220C\000\000\200\277\000\200\220C\000\000\200\277\000\000\221C\000\000\200\277\000\200\221C\000\000\200\277\000\000\222C\000\000\200\277\000\200\222C\000\000\200\277\000\000\223C\000\000\200\277\000\200\223C\000\000\200\277\000\000\224C\000\000\200\277\000\200\224C\000\000\200\277\000\200\225C\000\000\200\277\000\200\226C\000\000\200\277\000\000\227C\000\000\200\277\000\200\227C\000\000\200\277\000\000\230C\000\000\200\277\000\000\231C\000\000\200\277\000\200\231C\000\000\200\277\000\000\232C\000\000\200\277\000\200\232C\000\000\200\277\000\000\233C\000\000\200\277\000\200\233C\000\000\200\277\000\000\234C\000\000\200\277\000\200\234C\000\000\200\277\000\000\235C\000\000\200\277\000\200\235C\000\000\200\277\000\000\236C\000\000\200\277\000\200\236C\000\000\200\277\000\200\237C\000\000\200\277\000\000\240C\000\000\200\277\000\200\240C\000\000\200\277\000\000\241C\000\000\200\277\000\200\241C\000\000\200\277\000\000\242C\000\000\200\277\000\200\242C\000\000\200\277\000\000\243C\000\000\200\277\000\200\243C\000\000\200\277\000\000\244C\000\000\200\277\000\000\245C\000\000\200\277\000\200\245C\000\000\200\277\000\000\246C\000\000\200\277\000\000\247C\000\000\200\277\000\200\247C\000\000\200\277\000\000\250C\000\000\200\277\000\200\250C\000\000\200\277\000\000\251C\000\000\200\277\000\200\251C\000\000\200\277\000\000\252C\000\000\200\277\000\200\252C\000\000\200\277\000\000\253C\000\000\200\277\000\200\253C\000\000\200\277\000\200\254C\000\000\200\277\000\000\255C\000\000\200\277\000\200\255C\000\000\200\277\000\000\256C\000\000\200\277\000\200\256C\000\000\200\277\000\000\257C\000\000\200\277\000\200\257C\000\000\200\277\000\000\260C\000\000\200\277\000\200\260C\000\000\200\277\000\000\261C\000\000\200\277\000\200\261C\000\000\200\277\000\000\262C\000\000\200\277\000\200\262C\000\000\200\277\000\000\263C\000\000\200\277\000\200\263C\000\000\200\277\000\000\264C\000\000\200\277\000\200\264C\000\000\200\277\000\000\265C\000\000\200\277\000\000\266C\000\000\200\277\000\200\266C\000\000\200\277\000\000\267C\000\000\200\277\000\200\267C\000\000\200\277\000\000\270C\000\000\200\277\000\000\271C\000\000\200\277\000\200\271C\000\000\200\277\000\200\272C\000\000\200\277\000\200\273C\000\000\200\277\000\000\274C\000\000\200\277\000\200\274C\000\000\200\277\000\000\275C\000\000\200\277\000\200\275C\000\000\200\277\000\000\276C\000\000\200\277\000\200\276C\000\000\200\277\000\000\277C\000\000\200\277\000\200\277C\000\000\200\277\000\000\300C\000\000\200\277\000\200\300C\000\000\200\277\000\000\301C\000\000\200\277\000\200\301C\000\000\200\277\000\000\302C\000\000\200\277\000\000\303C\000\000\200\277\000\200\303C\000\000\200\277\000\200\304C\000\000\200\277\000\000\305C\000\000\200\277\000\200\305C\000\000\200\277\000\000\306C\000\000\200\277\000\200\306C\000\000\200\277\000\000\307C\000\000\200\277\000\200\307C\000\000\200\277\000\000\310C\000\000\200\277\000\200\310C\000\000\200\277\000\000\312C\000\000\200\277\000\200\312C\000\000\200\277\000\000\313C\000\000\200\277\000\200\313C\000\000\200\277\000\000\314C\000\000\200\277\000\200\314C\000\000\200\277\000\000\315C\000\000\200\277\000\200\315C\000\000\200\277\000\000\316C\000\000\200\277\000\200\316C\000\000\200\277\000\000\317C\000\000\200\277\000\200\317C\000\000\200\277\000\000\320C\000\000\200\277\000\200\320C\000\000\200\277\000\000\321C\000\000\200\277\000\200\321C\000\000\200\277\000\000\322C\000\000\200\277\000\200\323C\000\000\200\277\000\000\324C\000\000\200\277\000\200\324C\000\000\200\277\000\000\325C\000\000\200\277\000\000\326C\000\000\200\277\000\200\326C\000\000\200\277\000\000\327C\000\000\200\277\000\200\327C\000\000\200\277\000\000\331C\000\000\200\277\000\200\331C\000\000\200\277\000\000\332C\000\000\200\277\000\200\332C\000\000\200\277\000\000\333C\000\000\200\277\000\200\333C\000\000\200\277\000\000\334C\000\000\200\277\000\200\334C\000\000\200\277\000\200\335C\000\000\200\277\000\000\336C\000\000\200\277\000\200\336C\000\000\200\277\000\000\337C\000\000\200\277\000\200\337C\000\000\200\277\000\000\340C\000\000\200\277\000\200\340C\000\000\200\277\000\000\341C\000\000\200\277\000\200\341C\000\000\200\277\000\000\342C\000\000\200\277\000\200\342C\000\000\200\277\000\000\343C\000\000\200\277\000\000\344C\000\000\200\277\000\200\344C\000\000\200\277\000\200\345C\000\000\200\277\000\000\346C\000\000\200\277\000\200\346C\000\000\200\277"
      }
    }
  }
}
node {
  name: "data_loading/TensorSliceDataset_1"
  op: "TensorSliceDataset"
  input: "data_loading/tensors_1/normalize_tensors/component_0"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "data_loading/count_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "data_loading/RepeatDataset_1"
  op: "RepeatDataset"
  input: "data_loading/TensorSliceDataset_1"
  input: "data_loading/count_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "data_loading/num_parallel_calls_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "data_loading/ParallelMapDataset_1"
  op: "ParallelMapDataset"
  input: "data_loading/RepeatDataset_1"
  input: "data_loading/num_parallel_calls_1"
  attr {
    key: "Targuments"
    value {
      list {
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_Dataset_map_Davis2016Reader.test_dataset_map_325"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
  attr {
    key: "preserve_cardinality"
    value {
      b: false
    }
  }
  attr {
    key: "sloppy"
    value {
      b: false
    }
  }
  attr {
    key: "use_inter_op_parallelism"
    value {
      b: true
    }
  }
}
node {
  name: "data_loading/batch_size_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "data_loading/drop_remainder_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "data_loading/BatchDatasetV2_1"
  op: "BatchDatasetV2"
  input: "data_loading/ParallelMapDataset_1"
  input: "data_loading/batch_size_1"
  input: "data_loading/drop_remainder_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
  attr {
    key: "parallel_copy"
    value {
      b: false
    }
  }
}
node {
  name: "data_loading/buffer_size_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 96
      }
    }
  }
}
node {
  name: "data_loading/PrefetchDataset_1"
  op: "PrefetchDataset"
  input: "data_loading/BatchDatasetV2_1"
  input: "data_loading/buffer_size_2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
  attr {
    key: "slack_period"
    value {
      i: 0
    }
  }
}
node {
  name: "data_loading/optimizations_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3
          }
        }
        string_val: "map_and_batch_fusion"
        string_val: "noop_elimination"
        string_val: "shuffle_and_repeat_fusion"
      }
    }
  }
}
node {
  name: "data_loading/OptimizeDataset_1"
  op: "OptimizeDataset"
  input: "data_loading/PrefetchDataset_1"
  input: "data_loading/optimizations_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "optimization_configs"
    value {
      list {
        s: "map_vectorization:use_choose_fastest:false"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
}
node {
  name: "data_loading/ModelDataset_1"
  op: "ModelDataset"
  input: "data_loading/OptimizeDataset_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "cpu_budget"
    value {
      i: 0
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
}
node {
  name: "data_loading/IteratorV2_1"
  op: "IteratorV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "data_loading/MakeIterator_1"
  op: "MakeIterator"
  input: "data_loading/ModelDataset_1"
  input: "data_loading/IteratorV2_1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorV2_1"
      }
    }
  }
}
node {
  name: "data_loading/IteratorToStringHandle_1"
  op: "IteratorToStringHandle"
  input: "data_loading/IteratorV2_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "data_loading/IteratorGetNext_1"
  op: "IteratorGetNext"
  input: "data_loading/IteratorV2_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_STRING
      }
    }
  }
}
node {
  name: "cond/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_t"
  op: "Identity"
  input: "cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_f"
  op: "Identity"
  input: "cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Switch_1"
  op: "Switch"
  input: "data_loading/IteratorGetNext"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorGetNext"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "cond/Switch_2"
  op: "Switch"
  input: "data_loading/IteratorGetNext:1"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorGetNext"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 32
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "cond/Switch_3"
  op: "Switch"
  input: "data_loading/Const"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/Const"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Switch_4"
  op: "Switch"
  input: "data_loading/IteratorGetNext_1"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorGetNext_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "cond/Switch_5"
  op: "Switch"
  input: "data_loading/IteratorGetNext_1:1"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorGetNext_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "cond/Switch_6"
  op: "Switch"
  input: "data_loading/IteratorGetNext_1:2"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@data_loading/IteratorGetNext_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 384
          }
          dim {
            size: 640
          }
